stocks_translate_dict = {
 # 'EVGN': "אבוג'ן",
 # 'AUDC': 'אודיוקודס',
 # 'OPK': 'אופקו',
 # 'ORA': 'אורמת טכנו',
 # 'IFF': 'איי.אפ.אפ',
 # 'ICL': 'איי.סי.אל',
 # 'ITMR': 'איתמר',
 # 'ESLT': 'אלביט מערכות',
 # 'ALLT': 'אלוט',
 # 'GILT': 'גילת',
 # 'TSEM': 'טאואר',
 # 'TEVA': 'טבע',
 # 'KTOV': 'כיטוב פארמה',
 # 'LPSN': 'לייבפרסון',
 # 'BTX': 'ליניאג תרפיוטיק',
 # 'MGIC': "מג'יק",
 # 'NVMI': 'נובה',
 # 'NICE': 'נייס',
 # 'SPNS': 'ספיאנס',
 # 'SFET': 'סייפ-טי גרופ',
 # 'CEL': 'סלקום',
 # 'FRSX': 'פורסייט',
 # 'PSTI': 'פלוריסטם',
 # 'PLX': 'פרוטליקס',
 # 'PTNR': 'פרטנר',
 # 'PRGO': 'פריגו',
 # 'PERI': 'פריון',
 # 'CGEN': 'קומפיוגן',
 # 'KMDA': 'קמהדע',
 # 'CAMT': 'קמטק',
}


# from pprint import pprint
#
# stocks_name_list = ["EVGN",
#                     "AUDC",
#                     "OPK",
#                     "ORA",
#                     "IFF",
#                     "ICL",
#                     "ITMR",
#                     "ESLT",
#                     "ALLT",
#                     "GILT",
#                     "TSEM",
#                     "TEVA",
#                     "KTOV",
#                     "LPSN",
#                     # "BTX",
#                     "MGIC",
#                     "NVMI",
#                     "NICE",
#                     "SPNS",
#                     "SFET",
#                     "CEL",
#                     "FRSX",
#                     "PSTI",
#                     "PLX",
#                     "PTNR",
#                     "PRGO",
#                     "PERI",
#                     "CGEN",
#                     "KMDA",
#                     "CAMT"
#                     ]
# names = ["אבוג'ן"
#         ,"אודיוקודס"
#         ,"אופקו"
#         ,"אורמת טכנו"
#         ,"איי.אפ.אפ"
#         ,"איי.סי.אל"
#         ,"איתמר"
#         ,"אלביט מערכות"
#         ,"אלוט"
#         ,"גילת"
#         ,"טאואר"
#         ,"טבע"
#         ,"כיטוב פארמה"
#         ,"לייבפרסון"
#         ,"ליניאג תרפיוטיק"
#         ,"מג'יק"
#         ,"נובה"
#         ,"נייס"
#         ,"ספיאנס"
#         ,"סייפ-טי גרופ"
#         ,"סלקום"
#         ,"פורסייט"
#         ,"פלוריסטם"
#         ,"פרוטליקס"
#         ,"פרטנר"
#         ,"פריגו"
#         ,"פריון"
#         ,"קומפיוגן"
#         ,"קמהדע"
#         ,"קמטק"]
#
# def main():
#     dct = {}
#     i =0
#     for stk in stocks_name_list:
#         dct[stk] = names[i]
#         i+=1
#
#     pprint(dct)
#
# if __name__ == "__main__":
#     main()
